# Calculate

iOS-калькулятор с историей операций, разработанный на SwiftUI с использованием архитектуры MVVM.

## Технологии
- Swift 5.9
- SwiftUI
- MVVM архитектура
- @StateObject, @Published для связывания данных

##Операции
- Базовые математические операции (+, -, ×, ÷)
- История последних вычислений
- Адаптивный интерфейс для iPhone и iPad
- Кастомные кнопки с анимациями

## Запуск
1. Клонируйте репозиторий: `git clone https://github.com/ArtemFridman-sys/Calculate.git`
2. Откройте `Calculate.xcodeproj` в Xcode 15+
3. Запустите на симуляторе или реальном устройстве
